{
	"name": "alt Filler",
	"description": "Fill empty `alt` attributes with file name",
	"license": "GPL-3.0",
	"author": "Vittorio Ramponi - www.mywebpassion.it",
	"version": "1.1.0",
	"scope": "site",
	"minimumPubliiVersion": "0.40.0",
	"usePluginSettingsView": false,
    "previewNotRequired": true,
    "messageInOptions": {
        "type": "info",
        "text": "This plugin automatically populates empty alt attributes (alt=\"\") and adds missing alt attributes to <img> tags, using the corresponding image file name as the value. It ensures your images are more accessible and SEO-friendly"
    },
    "config": [
		{
			"name": "",
			"type": "separator",
			"note": "The <a href='https://github.com/gpsblues/Publii-Plugin-Alt-Filler' title='Github repository'>Plugin Alt Filler</a> processes featured images, single images, and galleries across all site pages. File names are adjusted for improved readability with the following enhancements:<ul><li>Removal of the file extension</li><li>Removal of the \"-thumbnail\" suffix for gallery images</li><li>Removal of final numbers: \"#\", \"-#\", \"_#\", \"(#)\"</li><li>Replacement of \"%20\" with spaces</li><li>Removal of special characters: \"(\", \")\", \"[\", \"]\", \"!\", \"?\", \"%\"</li><li>Replacement of separators: \"-\", \"_\", \".\", \",\" with spaces</li><li>Replacement of multiple spaces with a single space</li><li>Truncation to 125 characters to avoid overly long descriptions</li><li>Convert to lowercase with the first letter capitalized</li><li>Addition of a period at the end</li></ul><strong>Example</strong><br>&lt;img src=\"/media/posts/11/gallery/<strong>WHITE-cloud-2-in-blue-sky-(12)-thumbnail.webp</strong>\" alt=\"\"&gt;<br>&lt;img src=\"/media/posts/11/gallery/<strong>WHITE-cloud-2-in-blue-sky-(12)-thumbnail.webp</strong>\" alt=\"<strong>White cloud 2 in blue sky.</strong>\"&gt;<br><br><strong>Note</strong><br>The plugin uses regular expressions and is designed to work with code generated by Publii. It may not function properly on manually written, pasted, or custom template-derived code. Specifically, keep in mind that:<ul><li>If the \"alt\" attribute is missing, it will be added automatically. If it is already present but empty (\"alt=\"\"\"), it will be filled with the processed file name.</li><li>The \"alt\" attribute does not need to follow the \"src\" attribute immediately, but the \"src\" or \"srcset\" attribute must be present for the plugin to work.</li><li>The position of other attributes, such as \"title\", is irrelevant and does not affect the plugin's functionality.</li></ul>The filling of \"alt\" attributes is applied only to the HTML output. Publii's backend content remains unchanged.",
			"label": "",
			"group": "",
			"size": "no-line"
		}
    ]
}